In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.Series(np.random.uniform(size=9), index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],[1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.680450
   2    0.571075
   3    0.806711
b  1    0.247145
   3    0.486275
c  1    0.149628
   2    0.345109
d  2    0.830020
   3    0.663775
dtype: float64

In [4]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [5]:
data["b"]

1    0.247145
3    0.486275
dtype: float64

In [6]:
data.loc[["b", "d"]]

b  1    0.247145
   3    0.486275
d  2    0.830020
   3    0.663775
dtype: float64

In [7]:
data["b":"c"]

b  1    0.247145
   3    0.486275
c  1    0.149628
   2    0.345109
dtype: float64

In [8]:
data.loc[:, 2]

a    0.571075
c    0.345109
d    0.830020
dtype: float64

In [9]:
data.unstack()

          1         2         3
a  0.680450  0.571075  0.806711
b  0.247145       NaN  0.486275
c  0.149628  0.345109       NaN
d       NaN  0.830020  0.663775

In [10]:
data.unstack().stack()

a  1    0.680450
   2    0.571075
   3    0.806711
b  1    0.247145
   3    0.486275
c  1    0.149628
   2    0.345109
d  2    0.830020
   3    0.663775
dtype: float64

In [11]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),index=[["a", "a", "b", "b"], [1, 2, 1, 2]],columns=[["Ohio", "Ohio", "Colorado"],["Green", "Red", "Green"]])

In [12]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [14]:
frame.index.names = ["key1", "key2"]
frame.columns.names = ["state", "color"]

In [15]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [16]:
frame.index.nlevels

2

In [17]:
frame["Ohio"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [18]:
frame.groupby(level="key2").sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [20]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"] , "data1": pd.Series(range(7), dtype="Int64")})

In [21]:
df2 = pd.DataFrame({"key": ["a", "b", "d"],"data2": pd.Series(range(3), dtype="Int64")})

In [22]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [23]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [24]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [25]:
pd.merge(df1, df2, on="key")

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [26]:
df3 = pd.DataFrame({"lkey": ["b", "b", "a", "c", "a", "a", "b"],"data1": pd.Series(range(7), dtype="Int64")})

In [27]:
df4 = pd.DataFrame({"rkey": ["a", "b", "d"],"data2": pd.Series(range(3), dtype="Int64")})

In [28]:
pd.merge(df3, df4, left_on="lkey", right_on="rkey")

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [29]:
pd.merge(df1, df2, how="outer")

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0
6   c      3   <NA>
7   d   <NA>      2

In [30]:
left1 = pd.DataFrame({"key": ["a", "b", "a", "a", "b", "c"],"value": pd.Series(range(6), dtype="Int64")})

In [31]:
right1 = pd.DataFrame({"group_val": [3.5, 7]}, index=["a", "b"])

In [32]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [33]:
right1

   group_val
a        3.5
b        7.0

In [36]:
pd.merge(left1, right1, left_on="key", right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [37]:
pd.merge(left1, right1, left_on="key", right_index=True, how="outer")

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [38]:
left1.join(right1, how="outer")

   key  value  group_val
0    a      0        NaN
1    b      1        NaN
2    a      2        NaN
3    a      3        NaN
4    b      4        NaN
5    c      5        NaN
a  NaN   <NA>        3.5
b  NaN   <NA>        7.0

In [41]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                         index=["a", "c", "e"],
                         columns=["Ohio", "Nevada"]).astype("Int64")

In [42]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                          index=["b", "c", "d", "e"],
                          columns=["Missouri", "Alabama"]).astype("Int64")

In [43]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [44]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [48]:
pd.merge(left2, right2, how="outer", left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
b  <NA>    <NA>         7        8
c     3       4         9       10
d  <NA>    <NA>        11       12
e     5       6        13       14

In [45]:
left2.join(right2, how="outer")

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
b  <NA>    <NA>         7        8
c     3       4         9       10
d  <NA>    <NA>        11       12
e     5       6        13       14

In [47]:
left2.join(right2, how="inner")

   Ohio  Nevada  Missouri  Alabama
c     3       4         9       10
e     5       6        13       14

In [49]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                           index=["a", "c", "e", "f"],
                           columns=["New York", "Oregon"])

In [50]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2      <NA>     <NA>       7.0     8.0
c     3       4         9       10       9.0    10.0
e     5       6        13       14      11.0    12.0

In [51]:
a = pd.Series([np.nan, 2.5, 0.0, 3.5, 4.5, np.nan],
                  index=["f", "e", "d", "c", "b", "a"])

In [52]:
b = pd.Series([0., np.nan, 2., np.nan, np.nan, 5.],
                  index=["a", "b", "c", "d", "e", "f"])

In [53]:
a

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [54]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [55]:
np.where(pd.isna(a), b, a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [56]:
a.combine_first(b)

a    0.0
b    4.5
c    3.5
d    0.0
e    2.5
f    5.0
dtype: float64

In [57]:
df = pd.DataFrame({"key": ["foo", "bar", "baz"],
                       "A": [1, 2, 3],
                       "B": [4, 5, 6],
                       "C": [7, 8, 9]})

In [58]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [63]:
melted = pd.melt(df, id_vars="key")
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [61]:
reshaped = melted.pivot(index="key", columns="variable",
                            values="value")

In [62]:
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [65]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7